Kuza_Project/app/Controllers/Auth.php

INSERT INTO `users` (`name`, `email`, `password`) VALUES ('Salim', 'ngarejohnny@gmail.com', '12345')
---
                'password' => $password,
            ];
            $usersModel = new \App\Models\UsersModel();
            $query = $usersModel->insert($values);